# S language design
---
author: Jason Song <metaseed@gmail.com>
version: 1.0.0
tag: []
subPage: []
enable: [toc]

---
> pattern matching: recognize the pattern and mach to it, action
example:
```
[a,b]?action
recognize pattern: collection pattern, length is 2
match: a is the first, b is the last
```
> pattern match is destruct
```
variable# (a,b)
```
unmamed struct (tupple) pattern, variable pattern
created 2 variables
It's a pattern match expression returned bool, but not used

## Pattern Match Design
```
var#
   pattern ?if expression arm,
   pattern ?{if code block expression arm},
   pattern ?arm
   :else expression arm
```
real grammar:
```
 var#pattern   ?if expression arm
    ,pattern   ?{if code block expression arm}
    ,pattern   ?if expression arm
    ,pattern LogicConditionExpression  ?if expression arm
    :else expression arm
```  
  
```   
   #: pattern match operator
   ,: continue pattern match for var
   ?: condition?expression: if expression operator
   :: else expression operator
   ;: expression end symbol: end of the pattern match without else
   && and ||: lazy boolean expression operator
   & and |: 'and' and 'or' pattern mach oparator

```
```
type Some(i32)
let num = Some(4)
num#Some(x)&&x%2==0?x
```
   
   this design compatbale with ?: expression
   
```
   condition ?if expression arm
            :else expression arm
``` 
   ```
   if(a>100){}
   if(a>100){}else if(a<10){} else{}
   ```
 ```
 a>100?{};
 a>100?{}:a<10?{}:{}
 ```
   
   ```
a# >100?{};   
a# >100?{}, <10?{}: {}
   ```
## index range

1..4
1..^1
1..8\2: 1, 3,5,7
'a'..'j'

## collection pattern design
   [a,b,4..^4c,..f,d@6,e]
   scan from start then from end to fix every position
   
   
   any object that has
   
  patternMatch(pattern:str):bool
   
   
## enumeration expression
   ```
   IEnumrable @i pattern ? expression
     ,pattern ? expression
     :expression
  ```   
`return`, `yield`, `continue` and `break` in expression:
  * `break`: break the loop
  * `continue`: end this loop, and continue next loop
  * `yield`: yield one value to the result enumrable, and continue excution. we could yield several value to the result in one loop.
  
  * `return`: return from the parent function
  * `yield return`: yield valut to parent function.
  
  for simple for loop
  ```
  for(int i=0;i<100;i++) {}
  for(int i=0;i<100;i=i+2) {}
  for(let a of enumberable) {}
  for(let i,a of enumberable){}
  ```
  ```
0..100 @ i? {}
0..100\2 @ i? {}
enumberable @i a? {}
  ```
### loop expression
```
condition?expression\

expression\condition

i=1; b=2

while
k= i++<10 ? {
    b+=2;
    b>6 ? break 7;
}\

do while
k= {
    b+=2;
    b>6 ? break 7 : yield b
}\i++<10;

k={
b+=2
b>6?break 7
}\

k=i++<10ï¼Ÿb

```

### list comprehension
```python
fruits = ["apple", "banana", "cherry", "kiwi", "mango"]

newlist = [x for x in fruits if "a" in x]
```

```
// variable pattern and in pattern
[...(fruits@ x&("a" in x) ?x)]
// variable pattern and 'and' condition
[...(fruits@ x&&(x.include("a")) ?x)]
```
## Type
```
Type: type Name[([memberName':'][memberType][=defaultValueLiteral]@1[,...1])][{memberLogic}] 
memberType is either explicit or defered from defaultValueLiteral
// declear
type Name
type Name(i32,str)
type Name(a:i32,b = 1.2f32)
type Name(i32,str,d:i32,e:f64 = 1.2)
// a block of mem, with every member accessed by index, but with specific member accessed by name

// construct
let a = Name(1,3)
// access
let b = a.1 // by index
let c = a.c // by name
```
> compatable with function parameter design
> the function can be viewed as an expression with a type a parameter

## Type Pattern Match
```S
(x:_): a type with only member named as x
(x:_,..): a type with a member named as x
(x): a type with only one element, and match it to variable x
```

## Discriminated Unions
```
DiscriminatedUnions: type TypeName = SubTypeSymbol ('|'SubTypeSymbol)*[{memberLogic}] 
SubTypeSymbol: SubTypeName|Type
[...]: optional repeat

Type is defined in scope.
for a sybTypeSymbol: if not defined in scope, it's a subtype name and we create a subtype
```

```
type BinTree = Node(BinTree,BinTree) 
                           | Tip
```

## member logic
```
MemberLogic: {
expression |
function defination
...
}
```

## object
```
con constant
var variable

&: reference to const
&var:  reference to variable

```